export interface Course {
  code: string;
  name: string;
  department: string;
}

export const INITIAL_COURSES: Course[] = [
  // מדעי המחשב
  { code: "20441", name: "מבוא למדעי המחשב ושפת Java", department: "מדעי המחשב" },
  { code: "20407", name: "מבוא למדעי המחשב בשפת C", department: "מדעי המחשב" },
  { code: "20465", name: "מבוא למדעי המחשב ותכנות בשפת Python", department: "מדעי המחשב" },
  { code: "20453", name: "מבוא למדעי המחשב ושפת Java א'", department: "מדעי המחשב" },
  { code: "20454", name: "מבוא למדעי המחשב ושפת Java ב'", department: "מדעי המחשב" },
  { code: "20417", name: "מבני נתונים ומבוא לאלגוריתמים", department: "מדעי המחשב" },
  { code: "20277", name: "תכנות מונחה עצמים בשפת C++", department: "מדעי המחשב" },
  { code: "20554", name: "תכנות מתקדם בשפת Java", department: "מדעי המחשב" },
  { code: "20466", name: "לוגיקה למדעי המחשב", department: "מדעי המחשב" },
  { code: "20476", name: "מתמטיקה בדידה: תורת הקבוצות, קומבינטוריקה ותורת הגרפים", department: "מדעי המחשב" },
  { code: "20585", name: "מבוא לתורת החישוביות והסיבוכיות", department: "מדעי המחשב" },
  { code: "20582", name: "מבוא לרשתות תקשורת מחשבים", department: "מדעי המחשב" },
  
  // מתמטיקה
  { code: "04101", name: "אשנב למתמטיקה", department: "מתמטיקה" },
  { code: "20109", name: "אלגברה לינארית 1", department: "מתמטיקה" },
  { code: "20229", name: "אלגברה לינארית 2", department: "מתמטיקה" },
  { code: "20474", name: "חשבון אינפיניטסימלי 1", department: "מתמטיקה" },
  { code: "20475", name: "חשבון אינפיניטסימלי 2", department: "מתמטיקה" },
  { code: "20425", name: "הסתברות ומבוא לסטטיסטיקה למדעי המחשב", department: "מתמטיקה" },
  { code: "20462", name: "אנליזה נומרית 1", department: "מתמטיקה" },
  
  // כלכלה וניהול
  { code: "10131", name: "מבוא למיקרוכלכלה", department: "כלכלה וניהול" },
  { code: "10143", name: "מבוא למקרוכלכלה", department: "כלכלה וניהול" },
  { code: "10142", name: "חשבון דיפרנציאלי לתלמידי כלכלה וניהול", department: "כלכלה וניהול" },
  { code: "10230", name: "תורת המימון: ניהול פיננסי של גופים עסקיים", department: "כלכלה וניהול" },
  { code: "10599", name: "חשיבה אסטרטגית: תורת המשחקים ושימושיה בכלכלה ובניהול", department: "כלכלה וניהול" },
  { code: "10444", name: "נושאים במתמטיקה לתלמידי מדעי החברה", department: "כלכלה וניהול" },
  
  // מדעי החברה
  { code: "30105", name: "מבוא לפסיכולוגיה", department: "מדעי החברה" },
  { code: "30204", name: "הסקה סטטיסטית", department: "מדעי החברה" },
];

export const DEPARTMENTS = [
  "מדעי המחשב",
  "מתמטיקה",
  "כלכלה וניהול",
  "מדעי החברה",
  "פיסיקה",
  "כימיה",
  "מדעי החיים",
  "אחר"
];
